In [2]:
import pandas as pd

In [3]:
DATASET_PATH = "../data/dataset.csv"

df = pd.read_csv(DATASET_PATH)

In [4]:
df.head()

,Unnamed: 0,mark,model,generation_name,year,mileage,vol_engine,fuel,city,province,price
0,0,opel,combo,gen-d-2011,2015,139568,1248,Diesel,Janki,Mazowieckie,35900
1,1,opel,combo,gen-d-2011,2018,31991,1499,Diesel,Katowice,Śląskie,78501
2,2,opel,combo,gen-d-2011,2015,278437,1598,Diesel,Brzeg,Opolskie,27000
3,3,opel,combo,gen-d-2011,2016,47600,1248,Diesel,Korfantów,Opolskie,30800
4,4,opel,combo,gen-d-2011,2014,103000,1400,CNG,Tarnowskie Góry,Śląskie,35900

In [5]:
df.columns

Index(['Unnamed: 0', 'mark', 'model', 'generation_name', 'year', 'mileage',
       'vol_engine', 'fuel', 'city', 'province', 'price'],
      dtype='object')

In [6]:
df.describe()

          Unnamed: 0           year       mileage     vol_engine         price
count  117927.000000  117927.000000  1.179270e+05  117927.000000  1.179270e+05
mean    58963.000000    2012.925259  1.409768e+05    1812.057782  7.029988e+04
std     34042.736935       5.690135  9.236936e+04     643.613438  8.482458e+04
min         0.000000    1945.000000  0.000000e+00       0.000000  5.000000e+02
25%     29481.500000    2009.000000  6.700000e+04    1461.000000  2.100000e+04
50%     58963.000000    2013.000000  1.462690e+05    1796.000000  4.190000e+04
75%     88444.500000    2018.000000  2.030000e+05    1995.000000  8.360000e+04
max    117926.000000    2022.000000  2.800000e+06    7600.000000  2.399900e+06

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 117927 entries, 0 to 117926
Data columns (total 11 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   Unnamed: 0       117927 non-null  int64
 1   mark             117927 non-null  object
 2   model            117927 non-null  object
 3   generation_name  87842 non-null   object
 4   year             117927 non-null  int64
 5   mileage          117927 non-null  int64
 6   vol_engine       117927 non-null  int64
 7   fuel             117927 non-null  object
 8   city             117927 non-null  object
 9   province         117927 non-null  object
 10  price            117927 non-null  int64
dtypes: int64(5), object(6)
memory usage: 9.9+ MB

In [26]:
df["vol_engine"].value_counts().head(30)

vol_engine
1598    10206
1968     8121
1995     6545
1997     5340
1998     4498
1984     3327
1560     3233
999      3182
1798     2634
1498     2627
1969     2335
1390     2019
1199     1931
1197     1877
1796     1824
1364     1780
2967     1772
1461     1658
998      1653
1595     1643
1591     1617
1499     1585
2993     1575
1896     1518
1368     1499
1956     1403
1991     1251
0        1248
1242     1226
1198     1222
Name: count, dtype: int64

In [8]:
df.drop(columns=['Unnamed: 0'], inplace=True)

In [9]:
df["mark"].unique()

array(['opel', 'audi', 'bmw', 'volkswagen', 'ford', 'mercedes-benz',
       'renault', 'toyota', 'skoda', 'alfa-romeo', 'chevrolet', 'citroen',
       'fiat', 'honda', 'hyundai', 'kia', 'mazda', 'mini', 'mitsubishi',
       'nissan', 'peugeot', 'seat', 'volvo'], dtype=object)

In [10]:
df["fuel"].unique()

array(['Diesel', 'CNG', 'Gasoline', 'LPG', 'Hybrid', 'Electric'],
      dtype=object)

In [31]:
len(df["model"])

117927